#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.app_messages_xl[0]: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [20s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [20s elapsed]
module.storage_accounts.azurerm_storage_account.exportdata_weu_01: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata]
data.azurerm_linux_function_app.app_messages_xl[0]: Still reading... [20s elapsed]
data.azurerm_linux_function_app.app_messages_xl[1]: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
module.apim_weu.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [10s elapsed]
module.apim_itn.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.storage_accounts.azurerm_storage_account.exportdata_weu_01 will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata")
  ~ resource "azurerm_storage_account" "exportdata_weu_01" {
        access_tier                        = "Hot"
        account_kind                       = "StorageV2"
        account_replication_type           = "GZRS"
        account_tier                       = "Standard"
        allow_nested_items_to_be_public    = false
        allowed_copy_scope                 = null
        cross_tenant_replication_enabled   = false
        default_to_oauth_authentication    = false
        dns_endpoint_type                  = "Standard"
        edge_zone                          = null
        enable_https_traffic_only          = true
        https_traffic_only_enabled         = true
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
        infrastructure_encryption_enabled  = false
        is_hns_enabled                     = false
        large_file_share_enabled           = false
        local_user_enabled                 = true
        location                           = "westeurope"
        min_tls_version                    = "TLS1_2"
        name                               = "iopstexportdata"
        nfsv3_enabled                      = false
        primary_access_key                 = (sensitive value)
        primary_blob_connection_string     = (sensitive value)
        primary_blob_endpoint              = "https://iopstexportdata.blob.core.windows.net/"
        primary_blob_host                  = "iopstexportdata.blob.core.windows.net"
        primary_blob_internet_endpoint     = null
        primary_blob_internet_host         = null
        primary_blob_microsoft_endpoint    = null
        primary_blob_microsoft_host        = null
        primary_connection_string          = (sensitive value)
        primary_dfs_endpoint               = "https://iopstexportdata.dfs.core.windows.net/"
        primary_dfs_host                   = "iopstexportdata.dfs.core.windows.net"
        primary_dfs_internet_endpoint      = null
        primary_dfs_internet_host          = null
        primary_dfs_microsoft_endpoint     = null
        primary_dfs_microsoft_host         = null
        primary_file_endpoint              = "https://iopstexportdata.file.core.windows.net/"
        primary_file_host                  = "iopstexportdata.file.core.windows.net"
        primary_file_internet_endpoint     = null
        primary_file_internet_host         = null
        primary_file_microsoft_endpoint    = null
        primary_file_microsoft_host        = null
        primary_location                   = "westeurope"
        primary_queue_endpoint             = "https://iopstexportdata.queue.core.windows.net/"
        primary_queue_host                 = "iopstexportdata.queue.core.windows.net"
        primary_queue_microsoft_endpoint   = null
        primary_queue_microsoft_host       = null
        primary_table_endpoint             = "https://iopstexportdata.table.core.windows.net/"
        primary_table_host                 = "iopstexportdata.table.core.windows.net"
        primary_table_microsoft_endpoint   = null
        primary_table_microsoft_host       = null
        primary_web_endpoint               = "https://iopstexportdata.z6.web.core.windows.net/"
        primary_web_host                   = "iopstexportdata.z6.web.core.windows.net"
        primary_web_internet_endpoint      = null
        primary_web_internet_host          = null
        primary_web_microsoft_endpoint     = null
        primary_web_microsoft_host         = null
        public_network_access_enabled      = true
        queue_encryption_key_type          = "Service"
        resource_group_name                = "io-p-rg-operations"
        secondary_access_key               = (sensitive value)
        secondary_blob_connection_string   = (sensitive value)
        secondary_blob_endpoint            = null
        secondary_blob_host                = null
        secondary_blob_internet_endpoint   = null
        secondary_blob_internet_host       = null
        secondary_blob_microsoft_endpoint  = null
        secondary_blob_microsoft_host      = null
        secondary_connection_string        = (sensitive value)
        secondary_dfs_endpoint             = null
        secondary_dfs_host                 = null
        secondary_dfs_internet_endpoint    = null
        secondary_dfs_internet_host        = null
        secondary_dfs_microsoft_endpoint   = null
        secondary_dfs_microsoft_host       = null
        secondary_file_endpoint            = null
        secondary_file_host                = null
        secondary_file_internet_endpoint   = null
        secondary_file_internet_host       = null
        secondary_file_microsoft_endpoint  = null
        secondary_file_microsoft_host      = null
        secondary_location                 = "northeurope"
        secondary_queue_endpoint           = null
        secondary_queue_host               = null
        secondary_queue_microsoft_endpoint = null
        secondary_queue_microsoft_host     = null
        secondary_table_endpoint           = null
        secondary_table_host               = null
        secondary_table_microsoft_endpoint = null
        secondary_table_microsoft_host     = null
        secondary_web_endpoint             = null
        secondary_web_host                 = null
        secondary_web_internet_endpoint    = null
        secondary_web_internet_host        = null
        secondary_web_microsoft_endpoint   = null
        secondary_web_microsoft_host       = null
        sftp_enabled                       = false
        shared_access_key_enabled          = true
        table_encryption_key_type          = "Service"
      ~ tags                               = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
          - "environment"    = "prod" -> null
        }

        blob_properties {
            change_feed_enabled           = false
            change_feed_retention_in_days = 0
            default_service_version       = null
            last_access_time_enabled      = false
            versioning_enabled            = false
        }

        network_rules {
            bypass                     = [
                "AzureServices",
            ]
            default_action             = "Allow"
            ip_rules                   = [
                "2.39.114.32",
            ]
            virtual_network_subnet_ids = [
                "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/logicapp-common",
            ]
        }

        queue_properties {
            hour_metrics {
                enabled               = true
                include_apis          = true
                retention_policy_days = 7
                version               = "1.0"
            }
            logging {
                delete                = false
                read                  = false
                retention_policy_days = 0
                version               = "1.0"
                write                 = false
            }
            minute_metrics {
                enabled               = false
                include_apis          = false
                retention_policy_days = 0
                version               = "1.0"
            }
        }

        share_properties {
        }
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01"
      - min_api_version               = "2021-08-01" -> null
        name                          = "io-p-itn-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.app_backend_li_weu.module.appservice_app_backend.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CLOUD_ROLE_NAME"                     = "io-p-app-appbackendli"
          + "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
            # (113 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendli"
        name                                           = "io-p-app-appbackendli"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Source"                                         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (24 unchanged attributes hidden)

      + sticky_settings {
          + app_setting_names = [
              + "APPINSIGHTS_CLOUD_ROLE_NAME",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
            ]
        }

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_li_weu.module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CLOUD_ROLE_NAME"                     = "io-p-app-appbackendli-staging"
          + "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
          ~ "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5" -> "100"
          ~ "CGN_API_URL"                                     = "https://io-p-itn-cgn-card-func-01.azurewebsites.net" -> "https://io-p-itn-cgn-card-func-02.azurewebsites.net"
          ~ "CGN_OPERATOR_SEARCH_API_URL"                     = "https://io-p-itn-cgn-search-func-01.azurewebsites.net" -> "https://io-p-itn-cgn-search-func-02.azurewebsites.net"
            # (110 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendli/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["1"].module.appservice_app_backend.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CLOUD_ROLE_NAME"                     = "io-p-app-appbackendl1"
          + "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
            # (113 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl1"
        name                                           = "io-p-app-appbackendl1"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Source"                                         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (24 unchanged attributes hidden)

      + sticky_settings {
          + app_setting_names = [
              + "APPINSIGHTS_CLOUD_ROLE_NAME",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
            ]
        }

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["1"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CLOUD_ROLE_NAME"                     = "io-p-app-appbackendl1-staging"
          + "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
          ~ "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5" -> "100"
          ~ "CGN_API_URL"                                     = "https://io-p-itn-cgn-card-func-01.azurewebsites.net" -> "https://io-p-itn-cgn-card-func-02.azurewebsites.net"
          ~ "CGN_OPERATOR_SEARCH_API_URL"                     = "https://io-p-itn-cgn-search-func-01.azurewebsites.net" -> "https://io-p-itn-cgn-search-func-02.azurewebsites.net"
            # (110 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl1/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["2"].module.appservice_app_backend.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CLOUD_ROLE_NAME"                     = "io-p-app-appbackendl2"
          + "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
            # (113 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl2"
        name                                           = "io-p-app-appbackendl2"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Source"                                         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (24 unchanged attributes hidden)

      + sticky_settings {
          + app_setting_names = [
              + "APPINSIGHTS_CLOUD_ROLE_NAME",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
            ]
        }

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["2"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CLOUD_ROLE_NAME"                     = "io-p-app-appbackendl2-staging"
          + "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
          ~ "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5" -> "100"
          ~ "CGN_API_URL"                                     = "https://io-p-itn-cgn-card-func-01.azurewebsites.net" -> "https://io-p-itn-cgn-card-func-02.azurewebsites.net"
          ~ "CGN_OPERATOR_SEARCH_API_URL"                     = "https://io-p-itn-cgn-search-func-01.azurewebsites.net" -> "https://io-p-itn-cgn-search-func-02.azurewebsites.net"
            # (110 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl2/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins.module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins.module.storage_account.azurerm_role_assignment.queue["iopstexportdata|*|owner|Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_admins.module.storage_account.azurerm_role_assignment.table["iopstexportdata|*|writer"] will be created
  + resource "azurerm_role_assignment" "table" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs.module.storage_account.azurerm_role_assignment.blob["iopstexportdata|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs.module.storage_account.azurerm_role_assignment.queue["iopstexportdata|*|owner|Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_accounts.module.exportdata_weu_01_com_devs.module.storage_account.azurerm_role_assignment.table["iopstexportdata|*|writer"] will be created
  + resource "azurerm_role_assignment" "table" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-operations/providers/Microsoft.Storage/storageAccounts/iopstexportdata"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to import, 6 to add, 9 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app,
  on ../_modules/application_gateway/firewall.tf line 62, in resource "azurerm_web_application_firewall_policy" "api_app":
  62:         disabled_rules = [
  63:           "942100",
  64:           "942120",
  65:           "942190",
  66:           "942200",
  67:           "942210",
  68:           "942240",
  69:           "942250",
  70:           "942260",
  71:           "942330",
  72:           "942340",
  73:           "942370",
  74:           "942380",
  75:           "942430",
  76:           "942440",
  77:           "942450",
  78:         ]

`disabled_rules` will be removed in favour of the `rule` property in version
4.0 of the AzureRM Provider.

(and 53 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
